## Lesson 1: Pandas Beginnings

#### Lesson Overview
First, we will introduce a `DataFrame`, the core data structure of the *Pandas* library, and walk through some basics on working with them.

#### Lesson Goals
By the end of this lesson you shoul be able to
1. Load CSV data into a DataFrame
2. Perform DataFrame operations to inspect, filter, and calculate statistics about the data

In [1]:
# Load necessary packages for this lesson
import os

import pandas as pd

#### DataFrame Structure
A **DataFrame** is a heterogeneous table of data with column names. Each row in a DataFrame corresponds to one data sample, which consists of an entry for every single column. Consider the example in the following cell

* This DataFrame has column names: 'name', 'id', 'nametype', 'recclass', 'mass (g)' etc.

* The first row is a meteorite named 'Aachen' with id 1, a Valid nametype, L5 recclass, 21 gram mass, etc. We consider this row as a single data sample since it contains all information for one meteorite. Row two then contains all info for another meteorite.

In [2]:
filepath = os.path.realpath(os.path.join(os.getcwd(), '..', 'data', 'Meteorite_Landings.csv')) # Path to the data location
print(filepath) # display path to file for example purposes only
meteorites = pd.read_csv(filepath, nrows=5) # Load 5 rows of the data

meteorites # display the data

C:\Users\lyoca\Documents\_Projects\ai-workshop\data\Meteorite_Landings.csv

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

#### Load data from a CSV

In the previous cell, we showed an example of loading in a dataset about Meteorite Landings (*Source: [NASA's Open Data Portal](https://data.nasa.gov/Space-Science/Meteorite-Landings/gh4g-9sfh)*) from a CSV file

* We use the command/function: *pd.read_csv* which requires one input a string (or os.PathLike) specifying the file location 

<center> pd.read_csv(filepath) </center>

(*Note: There are many optional inputs to this function that handle some initial processing while reading in the file &ndash; check out the [documentation for all inputs](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html). Much of the time these optional inputs are unncessary and when they are I find a Google search or ChatGPT question about how I want to load in the data will tell me what to provide for these optional inputs.)*

##### Lets break down the previous cell in greater detail

1. Specify the path to the dataset
<center> filepath = os.path.realpath(os.path.join(os.getcwd(), '..', 'data', 'Meteorite_Landings.csv')) </center>

* *os.getcwd()* returns the path to your current working directory
* *os.path.join(os.getcwd(), '..', 'data', 'meteorite_Landings.csv')* joins together all inputs *os.getcwd()*, '..', 'data', and 'Meteorite_Landings.csv' into a single path. (Essentially it adds a backslash \ between each input)
	* Remark: the '..' actually tells Python to remove the previous folder from the path, which we can see using *os.path.realpath*
* *os.path.realpath(os.path.join(os.getcwd(), '..', 'data', 'meteorite_Landings.csv'))* this creates the "real path" by applying the operation that '..' performs

You can see these *os* commands in action by running the next cell. Note that a string specifying the path could be used instead of using these *os* commands. For example, open file explorer and navigate to the folder containing the file you want to load in. Right click the file, select "Properties" and a window will pop up. In this window locate the line "Location" and this is the file path to your file of interest. You can copy this as paste it into a string and use this as your filepath.

2. Load in the dataset
<center> meteorites = pd.read_csv(filepath, nrows=5) </center>

* This loads in the first 5 rows of the CSV file 'Meteorite_Landings.csv'

In [3]:
print(os.getcwd()) # should look like '<path to ai-workshop folder>\ai-workshop\pandas-notebooks'
print(os.path.join(os.getcwd(), '..', 'data', 'Meteorite_Landings.csv'))	# should look like '<path to ai-workshop folder>\ai-workshop\pandas-notebooks\..\data\Meteorite_Landings.csv'
print(os.path.realpath(os.path.join(os.getcwd(), '..', 'data', 'Meteorite_Landings.csv')))	# should look like '<path to ai-workshop folder>\ai-workshop\data\Meteorite_Landings.csv'

c:\Users\lyoca\Documents\_Projects\ai-workshop\pandas-notebooks
c:\Users\lyoca\Documents\_Projects\ai-workshop\pandas-notebooks\..\data\Meteorite_Landings.csv
C:\Users\lyoca\Documents\_Projects\ai-workshop\data\Meteorite_Landings.csv

#### Inspecting the data
Now that we have some data, lets perform an initial inspection of it. This gives us information on what the data looks like, how many rows/columns there are, what type of data we have etc.

First we will load the entire dataset by dropping the *nrows=5* optional input for *pd.read_csv*

In [4]:
meteorites = pd.read_csv(filepath) # load in the full dataset

How many rows and columns are there?

In [5]:
meteorites.shape

(45716, 10)

What are the column names?

In [6]:
meteorites.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass (g)', 'fall', 'year',
       'reclat', 'reclong', 'GeoLocation'],
      dtype='object')

What type of data does each column currently hold?

In [7]:
meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

What does the data look like?

In [8]:
meteorites.head() # display first 5 rows of the DataFrame

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

Sometimes there may be extraneous data at the end of the file, so checking the bottom few rows is also important:

In [9]:
meteorites.tail() # display final 5 rows of the DataFrame

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.98333, -115.68333)"

Get some summarized information about the DataFrame

In [10]:
meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

#### Extracting subsets

An important part of working with DataFrames is extracting subsets of the data: finding rows that meet a certain set of criteria, isolating columns/rows of interest, etc. After narrowing down our data, we are closer to discovering insights. This section will be the backbone of many analysis tasks.

#### Selecting columns

We can select columns as attributes if their names would be valid Python variables:

In [11]:
meteorites.name

0            Aachen
1            Aarhus
2              Abee
3          Acapulco
4           Achiras
            ...
45711    Zillah 002
45712        Zinder
45713          Zlin
45714     Zubkovsky
45715    Zulu Queen
Name: name, Length: 45716, dtype: object

Or we can select columns as dictionary string keys. Selecting columns must be done in this way in the column name is not a valid Python variable. For example the column 'mass (g)' must be selected as a dictionary key

In [12]:
meteorites['name']

0            Aachen
1            Aarhus
2              Abee
3          Acapulco
4           Achiras
            ...
45711    Zillah 002
45712        Zinder
45713          Zlin
45714     Zubkovsky
45715    Zulu Queen
Name: name, Length: 45716, dtype: object

We can also select multiple columns at once using a list of dictionary string keys

In [13]:
meteorites[['name', 'mass (g)']]

             name  mass (g)
0          Aachen      21.0
1          Aarhus     720.0
2            Abee  107000.0
3        Acapulco    1914.0
4         Achiras     780.0
...           ...       ...
45711  Zillah 002     172.0
45712      Zinder      46.0
45713        Zlin       3.3
45714   Zubkovsky    2167.0
45715  Zulu Queen     200.0

[45716 rows x 2 columns]

#### Selecting rows

We can select rows using standard Python list slicing

In [14]:
meteorites[100:104] # select rows 100 - 103

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
100,Benton,5026,Valid,LL6,2840.0,Fell,01/01/1949 12:00:00 AM,45.95000,-67.55000,"(45.95, -67.55)"
101,Berduc,48975,Valid,L6,270.0,Fell,01/01/2008 12:00:00 AM,-31.91000,-58.32833,"(-31.91, -58.32833)"
102,Béréba,5028,Valid,Eucrite-mmict,18000.0,Fell,01/01/1924 12:00:00 AM,11.65000,-3.65000,"(11.65, -3.65)"
103,Berlanguillas,5029,Valid,L6,1440.0,Fell,01/01/1811 12:00:00 AM,41.68333,-3.80000,"(41.68333, -3.8)"

#### Indexing: Selecting rows and columns

We use `iloc[]` to select rows and columns by their position:

In [15]:
meteorites.iloc[100:104, [0, 3, 4, 6]] # select rows 100 - 103 and columns at index 0, 3, 4, and 6

              name       recclass  mass (g)                    year
100         Benton            LL6    2840.0  01/01/1949 12:00:00 AM
101         Berduc             L6     270.0  01/01/2008 12:00:00 AM
102         Béréba  Eucrite-mmict   18000.0  01/01/1924 12:00:00 AM
103  Berlanguillas             L6    1440.0  01/01/1811 12:00:00 AM

We use `loc[]` to select by name:

In [16]:
meteorites.loc[100:104, 'mass (g)':'year'] # select rows 100 - 103 and columns 'mass (g)' - 'year'

     mass (g)  fall                    year
100    2840.0  Fell  01/01/1949 12:00:00 AM
101     270.0  Fell  01/01/2008 12:00:00 AM
102   18000.0  Fell  01/01/1924 12:00:00 AM
103    1440.0  Fell  01/01/1811 12:00:00 AM
104     960.0  Fell  01/01/2004 12:00:00 AM

In [17]:
meteorites.loc[100:104, ['name', 'mass (g)', 'year']] # select rows 100 - 103 and columns 'name', 'mass (g)', and 'year'

              name  mass (g)                    year
100         Benton    2840.0  01/01/1949 12:00:00 AM
101         Berduc     270.0  01/01/2008 12:00:00 AM
102         Béréba   18000.0  01/01/1924 12:00:00 AM
103  Berlanguillas    1440.0  01/01/1811 12:00:00 AM
104       Berthoud     960.0  01/01/2004 12:00:00 AM

#### Filtering with Boolean masks

A **Boolean** is a True or False value

A **Boolean mask** is a array-like structure of Boolean values &ndash; it's a way to specify which rows/columns we want to select (`True`) and which we don't (`False`)

Here's an example of a Boolean mask for meteorites weighing more than 50 grams that were found on Earth (i.e., they were not observed falling):

*(Note the syntax. We surround each condition with parentheses, and we use bitwise operators (`&`, `|`, `~`) instead of logical operators (`and`, `or`, `not`))*

In [18]:
mask = (meteorites['mass (g)'] > 50) & (meteorites.fall == 'Found')
print(mask)

0        False
1        False
2        False
3        False
4        False
         ...
45711     True
45712    False
45713    False
45714     True
45715     True
Length: 45716, dtype: bool

We can use this mask to select the subset of meteorites satisfying the condition that they weight more than 50 grams and were found on Earth

In [19]:
meteorites[mask]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37,Northwest Africa 5815,50693,Valid,L5,256.80,Found,NaN,0.00000,0.00000,"(0.0, 0.0)"
757,Dominion Range 03239,32591,Valid,L6,69.50,Found,01/01/2002 12:00:00 AM,NaN,NaN,NaN
804,Dominion Range 03240,32592,Valid,LL5,290.90,Found,01/01/2002 12:00:00 AM,NaN,NaN,NaN
1111,Abajo,4,Valid,H5,331.00,Found,01/01/1982 12:00:00 AM,26.80000,-105.41667,"(26.8, -105.41667)"
1112,Abar al' Uj 001,51399,Valid,H3.8,194.34,Found,01/01/2008 12:00:00 AM,22.72192,48.95937,"(22.72192, 48.95937)"
...,...,...,...,...,...,...,...,...,...,...
45709,Zhongxiang,30406,Valid,Iron,100000.00,Found,01/01/1981 12:00:00 AM,31.20000,112.50000,"(31.2, 112.5)"
45710,Zillah 001,31355,Valid,L6,1475.00,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45711,Zillah 002,31356,Valid,Eucrite,172.00,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45714,Zubkovsky,31357,Valid,L6,2167.00,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.00,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.98333, -115.68333)"

Here is another Boolean mask to select the subset of meteorites weighing more than 1 million grams (1,000 kilograms or roughly 2,205 pounds) that were observed falling:

In [20]:
mask = (meteorites['mass (g)'] > 1e6) & (meteorites.fall == 'Fell')
meteorites[mask]

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
29,Allende,2278,Valid,CV3,2000000.0,Fell,01/01/1969 12:00:00 AM,26.96667,-105.31667,"(26.96667, -105.31667)"
419,Jilin,12171,Valid,H5,4000000.0,Fell,01/01/1976 12:00:00 AM,44.05000,126.16667,"(44.05, 126.16667)"
506,Kunya-Urgench,12379,Valid,H5,1100000.0,Fell,01/01/1998 12:00:00 AM,42.25000,59.20000,"(42.25, 59.2)"
707,Norton County,17922,Valid,Aubrite,1100000.0,Fell,01/01/1948 12:00:00 AM,39.68333,-99.86667,"(39.68333, -99.86667)"
920,Sikhote-Alin,23593,Valid,"Iron, IIAB",23000000.0,Fell,01/01/1947 12:00:00 AM,46.16000,134.65333,"(46.16, 134.65333)"

An alternative to the Boolean masks above is the `query()` method of a DataFrame:

*(Note, in the `query()` method we can use both logical operators and bitwise operators)*

In [21]:
meteorites.query("`mass (g)` > 1e6 and fall == 'Fell'")

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
29,Allende,2278,Valid,CV3,2000000.0,Fell,01/01/1969 12:00:00 AM,26.96667,-105.31667,"(26.96667, -105.31667)"
419,Jilin,12171,Valid,H5,4000000.0,Fell,01/01/1976 12:00:00 AM,44.05000,126.16667,"(44.05, 126.16667)"
506,Kunya-Urgench,12379,Valid,H5,1100000.0,Fell,01/01/1998 12:00:00 AM,42.25000,59.20000,"(42.25, 59.2)"
707,Norton County,17922,Valid,Aubrite,1100000.0,Fell,01/01/1948 12:00:00 AM,39.68333,-99.86667,"(39.68333, -99.86667)"
920,Sikhote-Alin,23593,Valid,"Iron, IIAB",23000000.0,Fell,01/01/1947 12:00:00 AM,46.16000,134.65333,"(46.16, 134.65333)"

We can combine Boolean masks and `query()` with `loc[]` and `iloc[]`

In [22]:
meteorites[(meteorites['mass (g)'] > 1e6) & (meteorites.fall == 'Fell')].loc[0:500, ['name', 'mass (g)', 'year']] # from the first 500 meteorites select the ones weighing more than 1 million grams that were observed falling and display their name, mass, and what year they fell

        name   mass (g)                    year
29   Allende  2000000.0  01/01/1969 12:00:00 AM
419    Jilin  4000000.0  01/01/1976 12:00:00 AM

#### Calculating summary statistics

Next, we will discuss how we can calcualate various statistics of our dataset to gain some valuable insights

How many of the meteorites were found versus observed falling?

*(Note, pass in `normalize=True` to see this result as percentages. Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.value_counts.html) for additional functionality.)*

In [23]:
meteorites.fall.value_counts()

fall
Found    44609
Fell      1107
Name: count, dtype: int64

What was the mass of the average meterorite?

*(Note, the mean is being skewed upwards by some very heavy meteorites &ndash; the distribution is [right-skewed or positive-skewed](https://www.analyticsvidhya.com/blog/2020/07/what-is-skewness-statistics/))*

In [24]:
meteorites['mass (g)'].mean()

13278.078548601512

Taking a look at some quantiles at the extremes of the distribution shows that the mean is between the 95th and 99th percentile of the distribution, so it isn't a good measure of central tendency here

In [25]:
meteorites['mass (g)'].quantile([0.01, 0.05, 0.5, 0.95, 0.99])

0.01        0.44
0.05        1.10
0.50       32.60
0.95     4000.00
0.99    50600.00
Name: mass (g), dtype: float64

A better measure in this case is the median (50th percentile), since it is robust to outliers:

In [26]:
meteorites['mass (g)'].median()

32.6

What was the mass of the heaviest meteorite?

In [27]:
meteorites['mass (g)'].max()

60000000.0

Let's extract the information on this meteorite:

*(Note, `idxmax()` is a method that returns an index of the maximum entry)*

In [28]:
meteorites.loc[meteorites['mass (g)'].idxmax()]

name                             Hoba
id                              11890
nametype                        Valid
recclass                    Iron, IVB
mass (g)                   60000000.0
fall                            Found
year           01/01/1920 12:00:00 AM
reclat                      -19.58333
reclong                      17.91667
GeoLocation     (-19.58333, 17.91667)
Name: 16392, dtype: object

How many different types of meteorite classes are represented in this dataset?

*(Note, check out [this Wikipedia article](https://en.wikipedia.org/wiki/Meteorite_classification) for some information on meteorite classes.)*

In [29]:
print(meteorites.recclass.nunique()) # display number of classes

print(meteorites.recclass.unique()[:14]) # display a few examples of the unique classes

466
['L5' 'H6' 'EH4' 'Acapulcoite' 'L6' 'LL3-6' 'H5' 'L' 'Diogenite-pm'
 'Unknown' 'H4' 'H' 'Iron, IVA' 'CR2-an']

We can get common summary statistics for all columns at once. By default (i.e., not removing *include='all'*), this will only be numeric columns, but here, we will summarize everything together:

*(Note, `NaN` values signify missing data. For instance, the `fall` column contains strings, so there is no value for `mean`; likewise, `mass (g)` is numeric, so we don't have entries for the categorical summary statistics (`unique`, `top`, `freq`).)*

In [30]:
meteorites.describe(include='all')

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,45716.000000,45716,45716,4.558500e+04,45716,45425,38401.000000,38401.000000,38401
unique,45716,NaN,2,466,NaN,2,266,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,01/01/2003 12:00:00 AM,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,3323,NaN,NaN,6214
mean,NaN,26889.735104,NaN,NaN,1.327808e+04,NaN,NaN,-39.122580,61.074319,NaN
std,NaN,16860.683030,NaN,NaN,5.749889e+05,NaN,NaN,46.378511,80.647298,NaN
min,NaN,1.000000,NaN,NaN,0.000000e+00,NaN,NaN,-87.366670,-165.433330,NaN
25%,NaN,12688.750000,NaN,NaN,7.200000e+00,NaN,NaN,-76.714240,0.000000,NaN
50%,NaN,24261.500000,NaN,NaN,3.260000e+01,NaN,NaN,-71.500000,35.666670,NaN
75%,NaN,40656.750000,NaN,NaN,2.026000e+02,NaN,NaN,0.000000,157.166670,NaN
max,NaN,57458.000000,NaN,NaN,6.000000e+07,NaN,NaN,81.166670,354.473330,NaN

Check out the documentation for more descriptive statistics:

- [DataFrame Stats](https://pandas.pydata.org/docs/reference/frame.html#computations-descriptive-stats)

#### Check out lesson 1 the [workbook](./workbook.ipynb) for practice examples